print('Задача 3. Рамка')

# Напишите программу,
# которая рисует с помощью символьной графики прямоугольную рамку.
# Для вертикальных линий используйте символ вертикального штриха “|”,
# а для горизонтальных - дефис “-”. Пусть пользователь вводит ширину и высоту рамки.

#  _ _ _ _ _ _ _ _ _
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |_ _ _ _ _ _ _ _ _|

rows = int(input("Введите кол-во строк: "))
cols = int(input("Введите кол-во столбцов: "))

for row in range(rows):
	for col in range(cols):
		if col == 0 or col == cols - 1:
			print("|", end="")
		elif row == 0 or row == rows - 1:
			print("-", end="")
		else:
			print(" ", end="")

	print()
